awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f006x8.h
/********************************* Bit definition for GPIO_AFRL register ********************************************/
#define GPIO_AFRL_AFSEL0_Pos                      (0U)
#define GPIO_AFRL_AFSEL0_Msk                      (0xFUL<<GPIO_AFRL_AFSEL0_Pos)                     /*!< 0x0000000F */
#define GPIO_AFRL_AFSEL0                          GPIO_AFRL_AFSEL0_Msk                              /*!< GPIOA0 AF select */
#define GPIO_AFRL_AFSEL0_0                        (0x1UL<<GPIO_AFRL_AFSEL0_Pos)                     /*!< 0x00000001 */
#define GPIO_AFRL_AFSEL0_1                        (0x2UL<<GPIO_AFRL_AFSEL0_Pos)                     /*!< 0x00000002 */
#define GPIO_AFRL_AFSEL0_2                        (0x4UL<<GPIO_AFRL_AFSEL0_Pos)                     /*!< 0x00000004 */
#define GPIO_AFRL_AFSEL0_3                        (0x8UL<<GPIO_AFRL_AFSEL0_Pos)                     /*!< 0x00000008 */
#define GPIO_AFRL_AFSEL1_Pos                      (4U)
#define GPIO_AFRL_AFSEL1_Msk                      (0xFUL<<GPIO_AFRL_AFSEL1_Pos)                     /*!< 0x000000F0 */
#define GPIO_AFRL_AFSEL1                          GPIO_AFRL_AFSEL1_Msk                              /*!< GPIOA1 AF select */
#define GPIO_AFRL_AFSEL1_0                        (0x1UL<<GPIO_AFRL_AFSEL1_Pos)                     /*!< 0x00000010 */
#define GPIO_AFRL_AFSEL1_1                        (0x2UL<<GPIO_AFRL_AFSEL1_Pos)                     /*!< 0x00000020 */
#define GPIO_AFRL_AFSEL1_2                        (0x4UL<<GPIO_AFRL_AFSEL1_Pos)                     /*!< 0x00000040 */
#define GPIO_AFRL_AFSEL1_3                        (0x8UL<<GPIO_AFRL_AFSEL1_Pos)                     /*!< 0x00000080 */
#define GPIO_AFRL_AFSEL2_Pos                      (8U)
#define GPIO_AFRL_AFSEL2_Msk                      (0xFUL<<GPIO_AFRL_AFSEL2_Pos)                     /*!< 0x00000F00 */
#define GPIO_AFRL_AFSEL2                          GPIO_AFRL_AFSEL2_Msk                              /*!< GPIOA2 AF select */
#define GPIO_AFRL_AFSEL2_0                        (0x1UL<<GPIO_AFRL_AFSEL2_Pos)                     /*!< 0x00000100 */
#define GPIO_AFRL_AFSEL2_1                        (0x2UL<<GPIO_AFRL_AFSEL2_Pos)                     /*!< 0x00000200 */
#define GPIO_AFRL_AFSEL2_2                        (0x4UL<<GPIO_AFRL_AFSEL2_Pos)                     /*!< 0x00000400 */
#define GPIO_AFRL_AFSEL2_3                        (0x8UL<<GPIO_AFRL_AFSEL2_Pos)                     /*!< 0x00000800 */
#define GPIO_AFRL_AFSEL3_Pos                      (12U)
#define GPIO_AFRL_AFSEL3_Msk                      (0xFUL<<GPIO_AFRL_AFSEL3_Pos)                     /*!< 0x0000F000 */
#define GPIO_AFRL_AFSEL3                          GPIO_AFRL_AFSEL3_Msk                              /*!< GPIOA3 AF select */
#define GPIO_AFRL_AFSEL3_0                        (0x1UL<<GPIO_AFRL_AFSEL3_Pos)                     /*!< 0x00001000 */
#define GPIO_AFRL_AFSEL3_1                        (0x2UL<<GPIO_AFRL_AFSEL3_Pos)                     /*!< 0x00002000 */
#define GPIO_AFRL_AFSEL3_2                        (0x4UL<<GPIO_AFRL_AFSEL3_Pos)                     /*!< 0x00004000 */
#define GPIO_AFRL_AFSEL3_3                        (0x8UL<<GPIO_AFRL_AFSEL3_Pos)                     /*!< 0x00008000 */
#define GPIO_AFRL_AFSEL4_Pos                      (16U)
#define GPIO_AFRL_AFSEL4_Msk                      (0xFUL<<GPIO_AFRL_AFSEL4_Pos)                     /*!< 0x000F0000 */
#define GPIO_AFRL_AFSEL4                          GPIO_AFRL_AFSEL4_Msk                              /*!< GPIOA4 AF select */
#define GPIO_AFRL_AFSEL4_0                        (0x1UL<<GPIO_AFRL_AFSEL4_Pos)                     /*!< 0x00010000 */
#define GPIO_AFRL_AFSEL4_1                        (0x2UL<<GPIO_AFRL_AFSEL4_Pos)                     /*!< 0x00020000 */
#define GPIO_AFRL_AFSEL4_2                        (0x4UL<<GPIO_AFRL_AFSEL4_Pos)                     /*!< 0x00040000 */
#define GPIO_AFRL_AFSEL4_3                        (0x8UL<<GPIO_AFRL_AFSEL4_Pos)                     /*!< 0x00080000 */
#define GPIO_AFRL_AFSEL5_Pos                      (20U)
#define GPIO_AFRL_AFSEL5_Msk                      (0xFUL<<GPIO_AFRL_AFSEL5_Pos)                     /*!< 0x00F00000 */
#define GPIO_AFRL_AFSEL5                          GPIO_AFRL_AFSEL5_Msk                              /*!< GPIOA5 AF select */
#define GPIO_AFRL_AFSEL5_0                        (0x1UL<<GPIO_AFRL_AFSEL5_Pos)                     /*!< 0x00100000 */
#define GPIO_AFRL_AFSEL5_1                        (0x2UL<<GPIO_AFRL_AFSEL5_Pos)                     /*!< 0x00200000 */
#define GPIO_AFRL_AFSEL5_2                        (0x4UL<<GPIO_AFRL_AFSEL5_Pos)                     /*!< 0x00400000 */
#define GPIO_AFRL_AFSEL5_3                        (0x8UL<<GPIO_AFRL_AFSEL5_Pos)                     /*!< 0x00800000 */
#define GPIO_AFRL_AFSEL6_Pos                      (24U)
#define GPIO_AFRL_AFSEL6_Msk                      (0xFUL<<GPIO_AFRL_AFSEL6_Pos)                     /*!< 0x0F000000 */
#define GPIO_AFRL_AFSEL6                          GPIO_AFRL_AFSEL6_Msk                              /*!< GPIOA6 AF select */
#define GPIO_AFRL_AFSEL6_0                        (0x1UL<<GPIO_AFRL_AFSEL6_Pos)                     /*!< 0x01000000 */
#define GPIO_AFRL_AFSEL6_1                        (0x2UL<<GPIO_AFRL_AFSEL6_Pos)                     /*!< 0x02000000 */
#define GPIO_AFRL_AFSEL6_2                        (0x4UL<<GPIO_AFRL_AFSEL6_Pos)                     /*!< 0x04000000 */
#define GPIO_AFRL_AFSEL6_3                        (0x8UL<<GPIO_AFRL_AFSEL6_Pos)                     /*!< 0x08000000 */
#define GPIO_AFRL_AFSEL7_Pos                      (28U)
#define GPIO_AFRL_AFSEL7_Msk                      (0xFUL<<GPIO_AFRL_AFSEL7_Pos)                     /*!< 0xF0000000 */
#define GPIO_AFRL_AFSEL7                          GPIO_AFRL_AFSEL7_Msk                              /*!< GPIOA7 AF select */
#define GPIO_AFRL_AFSEL7_0                        (0x1UL<<GPIO_AFRL_AFSEL7_Pos)                     /*!< 0x10000000 */
#define GPIO_AFRL_AFSEL7_1                        (0x2UL<<GPIO_AFRL_AFSEL7_Pos)                     /*!< 0x20000000 */
#define GPIO_AFRL_AFSEL7_2                        (0x4UL<<GPIO_AFRL_AFSEL7_Pos)                     /*!< 0x40000000 */
#define GPIO_AFRL_AFSEL7_3                        (0x8UL<<GPIO_AFRL_AFSEL7_Pos)                     /*!< 0x80000000 */

/********************************* Bit definition for GPIO_AFRH register ********************************************/
#define GPIO_AFRH_AFSEL8_Pos                      (0U)
#define GPIO_AFRH_AFSEL8_Msk                      (0xFUL<<GPIO_AFRH_AFSEL8_Pos)                     /*!< 0x0000000F */
#define GPIO_AFRH_AFSEL8                          GPIO_AFRH_AFSEL8_Msk                              /*!< GPIOA8 AF select */
#define GPIO_AFRH_AFSEL8_0                        (0x1UL<<GPIO_AFRH_AFSEL8_Pos)                     /*!< 0x00000001 */
#define GPIO_AFRH_AFSEL8_1                        (0x2UL<<GPIO_AFRH_AFSEL8_Pos)                     /*!< 0x00000002 */
#define GPIO_AFRH_AFSEL8_2                        (0x4UL<<GPIO_AFRH_AFSEL8_Pos)                     /*!< 0x00000004 */
#define GPIO_AFRH_AFSEL8_3                        (0x8UL<<GPIO_AFRH_AFSEL8_Pos)                     /*!< 0x00000008 */
#define GPIO_AFRH_AFSEL9_Pos                      (4U)
#define GPIO_AFRH_AFSEL9_Msk                      (0xFUL<<GPIO_AFRH_AFSEL9_Pos)                     /*!< 0x000000F0 */
#define GPIO_AFRH_AFSEL9                          GPIO_AFRH_AFSEL9_Msk                              /*!< GPIOA9 AF select */
#define GPIO_AFRH_AFSEL9_0                        (0x1UL<<GPIO_AFRH_AFSEL9_Pos)                     /*!< 0x00000010 */
#define GPIO_AFRH_AFSEL9_1                        (0x2UL<<GPIO_AFRH_AFSEL9_Pos)                     /*!< 0x00000020 */
#define GPIO_AFRH_AFSEL9_2                        (0x4UL<<GPIO_AFRH_AFSEL9_Pos)                     /*!< 0x00000040 */
#define GPIO_AFRH_AFSEL9_3                        (0x8UL<<GPIO_AFRH_AFSEL9_Pos)                     /*!< 0x00000080 */
#define GPIO_AFRH_AFSEL10_Pos                     (8U)
#define GPIO_AFRH_AFSEL10_Msk                     (0xFUL<<GPIO_AFRH_AFSEL10_Pos)                    /*!< 0x00000F00 */
#define GPIO_AFRH_AFSEL10                         GPIO_AFRH_AFSEL10_Msk                             /*!< GPIOA10 AF select */
#define GPIO_AFRH_AFSEL10_0                       (0x1UL<<GPIO_AFRH_AFSEL10_Pos)                    /*!< 0x00000100 */
#define GPIO_AFRH_AFSEL10_1                       (0x2UL<<GPIO_AFRH_AFSEL10_Pos)                    /*!< 0x00000200 */
#define GPIO_AFRH_AFSEL10_2                       (0x4UL<<GPIO_AFRH_AFSEL10_Pos)                    /*!< 0x00000400 */
#define GPIO_AFRH_AFSEL10_3                       (0x8UL<<GPIO_AFRH_AFSEL10_Pos)                    /*!< 0x00000800 */
#define GPIO_AFRH_AFSEL11_Pos                     (12U)
#define GPIO_AFRH_AFSEL11_Msk                     (0xFUL<<GPIO_AFRH_AFSEL11_Pos)                    /*!< 0x0000F000 */
#define GPIO_AFRH_AFSEL11                         GPIO_AFRH_AFSEL11_Msk                             /*!< GPIOA11 AF select */
#define GPIO_AFRH_AFSEL11_0                       (0x1UL<<GPIO_AFRH_AFSEL11_Pos)                    /*!< 0x00001000 */
#define GPIO_AFRH_AFSEL11_1                       (0x2UL<<GPIO_AFRH_AFSEL11_Pos)                    /*!< 0x00002000 */
#define GPIO_AFRH_AFSEL11_2                       (0x4UL<<GPIO_AFRH_AFSEL11_Pos)                    /*!< 0x00004000 */
#define GPIO_AFRH_AFSEL11_3                       (0x8UL<<GPIO_AFRH_AFSEL11_Pos)                    /*!< 0x00008000 */
#define GPIO_AFRH_AFSEL12_Pos                     (16U)
#define GPIO_AFRH_AFSEL12_Msk                     (0xFUL<<GPIO_AFRH_AFSEL12_Pos)                    /*!< 0x000F0000 */
#define GPIO_AFRH_AFSEL12                         GPIO_AFRH_AFSEL12_Msk                             /*!< GPIOA12 AF select */
#define GPIO_AFRH_AFSEL12_0                       (0x1UL<<GPIO_AFRH_AFSEL12_Pos)                    /*!< 0x00010000 */
#define GPIO_AFRH_AFSEL12_1                       (0x2UL<<GPIO_AFRH_AFSEL12_Pos)                    /*!< 0x00020000 */
#define GPIO_AFRH_AFSEL12_2                       (0x4UL<<GPIO_AFRH_AFSEL12_Pos)                    /*!< 0x00040000 */
#define GPIO_AFRH_AFSEL12_3                       (0x8UL<<GPIO_AFRH_AFSEL12_Pos)                    /*!< 0x00080000 */
#define GPIO_AFRH_AFSEL13_Pos                     (20U)
#define GPIO_AFRH_AFSEL13_Msk                     (0xFUL<<GPIO_AFRH_AFSEL13_Pos)                    /*!< 0x00F00000 */
#define GPIO_AFRH_AFSEL13                         GPIO_AFRH_AFSEL13_Msk                             /*!< GPIOA13 AF select */
#define GPIO_AFRH_AFSEL13_0                       (0x1UL<<GPIO_AFRH_AFSEL13_Pos)                    /*!< 0x00100000 */
#define GPIO_AFRH_AFSEL13_1                       (0x2UL<<GPIO_AFRH_AFSEL13_Pos)                    /*!< 0x00200000 */
#define GPIO_AFRH_AFSEL13_2                       (0x4UL<<GPIO_AFRH_AFSEL13_Pos)                    /*!< 0x00400000 */
#define GPIO_AFRH_AFSEL13_3                       (0x8UL<<GPIO_AFRH_AFSEL13_Pos)                    /*!< 0x00800000 */
#define GPIO_AFRH_AFSEL14_Pos                     (24U)
#define GPIO_AFRH_AFSEL14_Msk                     (0xFUL<<GPIO_AFRH_AFSEL14_Pos)                    /*!< 0x0F000000 */
#define GPIO_AFRH_AFSEL14                         GPIO_AFRH_AFSEL14_Msk                             /*!< GPIOA14 AF select */
#define GPIO_AFRH_AFSEL14_0                       (0x1UL<<GPIO_AFRH_AFSEL14_Pos)                    /*!< 0x01000000 */
#define GPIO_AFRH_AFSEL14_1                       (0x2UL<<GPIO_AFRH_AFSEL14_Pos)                    /*!< 0x02000000 */
#define GPIO_AFRH_AFSEL14_2                       (0x4UL<<GPIO_AFRH_AFSEL14_Pos)                    /*!< 0x04000000 */
#define GPIO_AFRH_AFSEL14_3                       (0x8UL<<GPIO_AFRH_AFSEL14_Pos)                    /*!< 0x08000000 */
#define GPIO_AFRH_AFSEL15_Pos                     (28U)
#define GPIO_AFRH_AFSEL15_Msk                     (0xFUL<<GPIO_AFRH_AFSEL15_Pos)                    /*!< 0xF0000000 */
#define GPIO_AFRH_AFSEL15                         GPIO_AFRH_AFSEL15_Msk                             /*!< GPIOA15 AF select */
#define GPIO_AFRH_AFSEL15_0                       (0x1UL<<GPIO_AFRH_AFSEL15_Pos)                    /*!< 0x10000000 */
#define GPIO_AFRH_AFSEL15_1                       (0x2UL<<GPIO_AFRH_AFSEL15_Pos)                    /*!< 0x20000000 */
#define GPIO_AFRH_AFSEL15_2                       (0x4UL<<GPIO_AFRH_AFSEL15_Pos)                    /*!< 0x40000000 */
#define GPIO_AFRH_AFSEL15_3                       (0x8UL<<GPIO_AFRH_AFSEL15_Pos)                    /*!< 0x80000000 */

/********************************* Bit definition for GPIO_BRR register *********************************************/
#define GPIO_BRR_BR0_Pos                          (0U)
#define GPIO_BRR_BR0_Msk                          (0x1UL<<GPIO_BRR_BR0_Pos)                         /*!< 0x00000001 */
#define GPIO_BRR_BR0                              GPIO_BRR_BR0_Msk                                  /*!< GPIOA 0 output pin reset */
#define GPIO_BRR_BR1_Pos                          (1U)
#define GPIO_BRR_BR1_Msk                          (0x1UL<<GPIO_BRR_BR1_Pos)                         /*!< 0x00000002 */
#define GPIO_BRR_BR1                              GPIO_BRR_BR1_Msk                                  /*!< GPIOA 1 output pin reset */
#define GPIO_BRR_BR2_Pos                          (2U)
#define GPIO_BRR_BR2_Msk                          (0x1UL<<GPIO_BRR_BR2_Pos)                         /*!< 0x00000004 */
#define GPIO_BRR_BR2                              GPIO_BRR_BR2_Msk                                  /*!< GPIOA 2 output pin reset */
#define GPIO_BRR_BR3_Pos                          (3U)
#define GPIO_BRR_BR3_Msk                          (0x1UL<<GPIO_BRR_BR3_Pos)                         /*!< 0x00000008 */
#define GPIO_BRR_BR3                              GPIO_BRR_BR3_Msk                                  /*!< GPIOA 3 output pin reset */
#define GPIO_BRR_BR4_Pos                          (4U)
#define GPIO_BRR_BR4_Msk                          (0x1UL<<GPIO_BRR_BR4_Pos)                         /*!< 0x00000010 */
#define GPIO_BRR_BR4                              GPIO_BRR_BR4_Msk                                  /*!< GPIOA 4 output pin reset */
#define GPIO_BRR_BR5_Pos                          (5U)
#define GPIO_BRR_BR5_Msk                          (0x1UL<<GPIO_BRR_BR5_Pos)                         /*!< 0x00000020 */
#define GPIO_BRR_BR5                              GPIO_BRR_BR5_Msk                                  /*!< GPIOA 5 output pin reset */
#define GPIO_BRR_BR6_Pos                          (6U)
#define GPIO_BRR_BR6_Msk                          (0x1UL<<GPIO_BRR_BR6_Pos)                         /*!< 0x00000040 */
#define GPIO_BRR_BR6                              GPIO_BRR_BR6_Msk                                  /*!< GPIOA 6 output pin reset */
#define GPIO_BRR_BR7_Pos                          (7U)
#define GPIO_BRR_BR7_Msk                          (0x1UL<<GPIO_BRR_BR7_Pos)                         /*!< 0x00000080 */
#define GPIO_BRR_BR7                              GPIO_BRR_BR7_Msk                                  /*!< GPIOA 7 output pin reset */
#define GPIO_BRR_BR8_Pos                          (8U)
#define GPIO_BRR_BR8_Msk                          (0x1UL<<GPIO_BRR_BR8_Pos)                         /*!< 0x00000100 */
#define GPIO_BRR_BR8                              GPIO_BRR_BR8_Msk                                  /*!< GPIOA 8 output pin reset */
#define GPIO_BRR_BR9_Pos                          (9U)
#define GPIO_BRR_BR9_Msk                          (0x1UL<<GPIO_BRR_BR9_Pos)                         /*!< 0x00000200 */
#define GPIO_BRR_BR9                              GPIO_BRR_BR9_Msk                                  /*!< GPIOA 9 output pin reset */
#define GPIO_BRR_BR10_Pos                         (10U)
#define GPIO_BRR_BR10_Msk                         (0x1UL<<GPIO_BRR_BR10_Pos)                        /*!< 0x00000400 */
#define GPIO_BRR_BR10                             GPIO_BRR_BR10_Msk                                 /*!< GPIOA 10 output pin reset */
#define GPIO_BRR_BR11_Pos                         (11U)
#define GPIO_BRR_BR11_Msk                         (0x1UL<<GPIO_BRR_BR11_Pos)                        /*!< 0x00000800 */
#define GPIO_BRR_BR11                             GPIO_BRR_BR11_Msk                                 /*!< GPIOA 11 output pin reset */
#define GPIO_BRR_BR12_Pos                         (12U)
#define GPIO_BRR_BR12_Msk                         (0x1UL<<GPIO_BRR_BR12_Pos)                        /*!< 0x00001000 */
#define GPIO_BRR_BR12                             GPIO_BRR_BR12_Msk                                 /*!< GPIOA 12 output pin reset */
#define GPIO_BRR_BR13_Pos                         (13U)
#define GPIO_BRR_BR13_Msk                         (0x1UL<<GPIO_BRR_BR13_Pos)                        /*!< 0x00002000 */
#define GPIO_BRR_BR13                             GPIO_BRR_BR13_Msk                                 /*!< GPIOA 13 output pin reset */
#define GPIO_BRR_BR14_Pos                         (14U)
#define GPIO_BRR_BR14_Msk                         (0x1UL<<GPIO_BRR_BR14_Pos)                        /*!< 0x00004000 */
#define GPIO_BRR_BR14                             GPIO_BRR_BR14_Msk                                 /*!< GPIOA 14 output pin reset */
#define GPIO_BRR_BR15_Pos                         (15U)
#define GPIO_BRR_BR15_Msk                         (0x1UL<<GPIO_BRR_BR15_Pos)                        /*!< 0x00008000 */
#define GPIO_BRR_BR15                             GPIO_BRR_BR15_Msk                                 /*!< GPIOA 15 output pin reset */

