awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f006x8.h
#define TIM_CCMR2_OC3CE_Pos              (7U)
#define TIM_CCMR2_OC3CE_Msk              (0x1UL<<TIM_CCMR2_OC3CE_Pos)             /*!< 0x00000080 */
#define TIM_CCMR2_OC3CE                  TIM_CCMR2_OC3CE_Msk                      
#define TIM_CCMR2_CC4S_Pos               (8U)
#define TIM_CCMR2_CC4S_Msk               (0x3UL<<TIM_CCMR2_CC4S_Pos)              /*!< 0x00000300 */
#define TIM_CCMR2_CC4S                   TIM_CCMR2_CC4S_Msk
#define TIM_CCMR2_CC4S_0                 (0x1UL<<TIM_CCMR2_CC4S_Pos)              /*!< 0x00000100 */
#define TIM_CCMR2_CC4S_1                 (0x2UL<<TIM_CCMR2_CC4S_Pos)              /*!< 0x00000200 */
#define TIM_CCMR2_OC4FE_Pos              (10U)
#define TIM_CCMR2_OC4FE_Msk              (0x1UL<<TIM_CCMR2_OC4FE_Pos)             /*!< 0x00000400 */
#define TIM_CCMR2_OC4FE                  TIM_CCMR2_OC4FE_Msk                      
#define TIM_CCMR2_OC4PE_Pos              (11U)
#define TIM_CCMR2_OC4PE_Msk              (0x1UL<<TIM_CCMR2_OC4PE_Pos)             /*!< 0x00000800 */
#define TIM_CCMR2_OC4PE                  TIM_CCMR2_OC4PE_Msk                      
               
#define TIM_CCMR2_OC4M_Pos                       (12U)
#define TIM_CCMR2_OC4M_Msk                       (0x1007UL << TIM_CCMR2_OC4M_Pos)              /*!< 0x01007000 */
#define TIM_CCMR2_OC4M                           TIM_CCMR2_OC4M_Msk                            /*!<OC4M[3:0] bits (Output Compare 4 Mode) */
#define TIM_CCMR2_OC4M_0                         (0x1UL << TIM_CCMR2_OC4M_Pos)                 /*!< 0x00001000 */
#define TIM_CCMR2_OC4M_1                         (0x2UL << TIM_CCMR2_OC4M_Pos)                 /*!< 0x00002000 */
#define TIM_CCMR2_OC4M_2                         (0x4UL << TIM_CCMR2_OC4M_Pos)                 /*!< 0x00004000 */
#define TIM_CCMR2_OC4M_3                         (0x1000UL << TIM_CCMR2_OC4M_Pos)              /*!< 0x01000000 */
        
#define TIM_CCMR2_OC4CE_Pos              (15U)
#define TIM_CCMR2_OC4CE_Msk              (0x1UL<<TIM_CCMR2_OC4CE_Pos)             /*!< 0x00008000 */
#define TIM_CCMR2_OC4CE                  TIM_CCMR2_OC4CE_Msk                      

/********************************* Bit definition for TIM_CCMR2 register ***********************************/
#define TIM_CCMR2_IC3PSC_Pos             (2U)
#define TIM_CCMR2_IC3PSC_Msk             (0x3UL<<TIM_CCMR2_IC3PSC_Pos)            /*!< 0x0000000C */
#define TIM_CCMR2_IC3PSC                 TIM_CCMR2_IC3PSC_Msk
#define TIM_CCMR2_IC3PSC_0               (0x1UL<<TIM_CCMR2_IC3PSC_Pos)            /*!< 0x00000004 */
#define TIM_CCMR2_IC3PSC_1               (0x2UL<<TIM_CCMR2_IC3PSC_Pos)            /*!< 0x00000008 */
#define TIM_CCMR2_IC3F_Pos               (4U)
#define TIM_CCMR2_IC3F_Msk               (0xFUL<<TIM_CCMR2_IC3F_Pos)              /*!< 0x000000F0 */
#define TIM_CCMR2_IC3F                   TIM_CCMR2_IC3F_Msk
#define TIM_CCMR2_IC3F_0                 (0x1UL<<TIM_CCMR2_IC3F_Pos)              /*!< 0x00000010 */
#define TIM_CCMR2_IC3F_1                 (0x2UL<<TIM_CCMR2_IC3F_Pos)              /*!< 0x00000020 */
#define TIM_CCMR2_IC3F_2                 (0x4UL<<TIM_CCMR2_IC3F_Pos)              /*!< 0x00000040 */
#define TIM_CCMR2_IC3F_3                 (0x8UL<<TIM_CCMR2_IC3F_Pos)              /*!< 0x00000080 */

#define TIM_CCMR2_IC4PSC_Pos             (10U)
#define TIM_CCMR2_IC4PSC_Msk             (0x3UL<<TIM_CCMR2_IC4PSC_Pos)            /*!< 0x00000C00 */
#define TIM_CCMR2_IC4PSC                 TIM_CCMR2_IC4PSC_Msk
#define TIM_CCMR2_IC4PSC_0               (0x1UL<<TIM_CCMR2_IC4PSC_Pos)            /*!< 0x00000400 */
#define TIM_CCMR2_IC4PSC_1               (0x2UL<<TIM_CCMR2_IC4PSC_Pos)            /*!< 0x00000800 */
#define TIM_CCMR2_IC4F_Pos               (12U)
#define TIM_CCMR2_IC4F_Msk               (0xFUL<<TIM_CCMR2_IC4F_Pos)              /*!< 0x0000F000 */
#define TIM_CCMR2_IC4F                   TIM_CCMR2_IC4F_Msk
#define TIM_CCMR2_IC4F_0                 (0x1UL<<TIM_CCMR2_IC4F_Pos)              /*!< 0x00001000 */
#define TIM_CCMR2_IC4F_1                 (0x2UL<<TIM_CCMR2_IC4F_Pos)              /*!< 0x00002000 */
#define TIM_CCMR2_IC4F_2                 (0x4UL<<TIM_CCMR2_IC4F_Pos)              /*!< 0x00004000 */
#define TIM_CCMR2_IC4F_3                 (0x8UL<<TIM_CCMR2_IC4F_Pos)              /*!< 0x00008000 */

/********************************* Bit definition for TIM_CCER register ********************************************/
#define TIM_CCER_CC1E_Pos                        (0U)
#define TIM_CCER_CC1E_Msk                        (0x1UL<<TIM_CCER_CC1E_Pos)                       /*!< 0x00000001 */
#define TIM_CCER_CC1E                            TIM_CCER_CC1E_Msk                                
#define TIM_CCER_CC1P_Pos                        (1U)
#define TIM_CCER_CC1P_Msk                        (0x1UL<<TIM_CCER_CC1P_Pos)                       /*!< 0x00000002 */
#define TIM_CCER_CC1P                            TIM_CCER_CC1P_Msk                                
#define TIM_CCER_CC1NE_Pos                       (2U)
#define TIM_CCER_CC1NE_Msk                       (0x1UL<<TIM_CCER_CC1NE_Pos)                      /*!< 0x00000004 */
#define TIM_CCER_CC1NE                           TIM_CCER_CC1NE_Msk                               
#define TIM_CCER_CC1NP_Pos                       (3U)
#define TIM_CCER_CC1NP_Msk                       (0x1UL<<TIM_CCER_CC1NP_Pos)                      /*!< 0x00000008 */
#define TIM_CCER_CC1NP                           TIM_CCER_CC1NP_Msk                               
#define TIM_CCER_CC2E_Pos                        (4U)
#define TIM_CCER_CC2E_Msk                        (0x1UL<<TIM_CCER_CC2E_Pos)                       /*!< 0x00000010 */
#define TIM_CCER_CC2E                            TIM_CCER_CC2E_Msk                                
#define TIM_CCER_CC2P_Pos                        (5U)
#define TIM_CCER_CC2P_Msk                        (0x1UL<<TIM_CCER_CC2P_Pos)                       /*!< 0x00000020 */
#define TIM_CCER_CC2P                            TIM_CCER_CC2P_Msk                                
#define TIM_CCER_CC2NE_Pos                       (6U)
#define TIM_CCER_CC2NE_Msk                       (0x1UL<<TIM_CCER_CC2NE_Pos)                      /*!< 0x00000040 */
#define TIM_CCER_CC2NE                           TIM_CCER_CC2NE_Msk                               
#define TIM_CCER_CC2NP_Pos                       (7U)
#define TIM_CCER_CC2NP_Msk                       (0x1UL<<TIM_CCER_CC2NP_Pos)                      /*!< 0x00000080 */
#define TIM_CCER_CC2NP                           TIM_CCER_CC2NP_Msk                               
#define TIM_CCER_CC3E_Pos                        (8U)
#define TIM_CCER_CC3E_Msk                        (0x1UL<<TIM_CCER_CC3E_Pos)                       /*!< 0x00000100 */
#define TIM_CCER_CC3E                            TIM_CCER_CC3E_Msk                                
#define TIM_CCER_CC3P_Pos                        (9U)
#define TIM_CCER_CC3P_Msk                        (0x1UL<<TIM_CCER_CC3P_Pos)                       /*!< 0x00000200 */
#define TIM_CCER_CC3P                            TIM_CCER_CC3P_Msk                                
#define TIM_CCER_CC3NE_Pos                       (10U)
#define TIM_CCER_CC3NE_Msk                       (0x1UL<<TIM_CCER_CC3NE_Pos)                      /*!< 0x00000400 */
#define TIM_CCER_CC3NE                           TIM_CCER_CC3NE_Msk                               
#define TIM_CCER_CC3NP_Pos                       (11U)
#define TIM_CCER_CC3NP_Msk                       (0x1UL<<TIM_CCER_CC3NP_Pos)                      /*!< 0x00000800 */
#define TIM_CCER_CC3NP                           TIM_CCER_CC3NP_Msk                               
#define TIM_CCER_CC4E_Pos                        (12U)
#define TIM_CCER_CC4E_Msk                        (0x1UL<<TIM_CCER_CC4E_Pos)                       /*!< 0x00001000 */
#define TIM_CCER_CC4E                            TIM_CCER_CC4E_Msk                                
#define TIM_CCER_CC4P_Pos                        (13U)
#define TIM_CCER_CC4P_Msk                        (0x1UL<<TIM_CCER_CC4P_Pos)                       /*!< 0x00002000 */
#define TIM_CCER_CC4P                            TIM_CCER_CC4P_Msk                                
#define TIM_CCER_CC5E_Pos                        (16U)
#define TIM_CCER_CC5E_Msk                        (0x1UL<<TIM_CCER_CC5E_Pos)                       /*!< 0x00010000 */
#define TIM_CCER_CC5E                            TIM_CCER_CC5E_Msk                                
#define TIM_CCER_CC5P_Pos                        (17U)
#define TIM_CCER_CC5P_Msk                        (0x1UL<<TIM_CCER_CC5P_Pos)                       /*!< 0x00020000 */
#define TIM_CCER_CC5P                            TIM_CCER_CC5P_Msk                                
#define TIM_CCER_CC6E_Pos                        (20U)
#define TIM_CCER_CC6E_Msk                        (0x1UL<<TIM_CCER_CC6E_Pos)                       /*!< 0x00100000 */
#define TIM_CCER_CC6E                            TIM_CCER_CC6E_Msk                                
#define TIM_CCER_CC6P_Pos                        (21U)
#define TIM_CCER_CC6P_Msk                        (0x1UL<<TIM_CCER_CC6P_Pos)                       /*!< 0x00200000 */
#define TIM_CCER_CC6P                            TIM_CCER_CC6P_Msk                                

/********************************* Bit definition for TIM_CNT register *********************************************/
#define TIM_CNT_CNT_Pos                          (0U)
#define TIM_CNT_CNT_Msk                          (0xFFFFUL<<TIM_CNT_CNT_Pos)                      /*!< 0x0000FFFF */
#define TIM_CNT_CNT                              TIM_CNT_CNT_Msk

/********************************* Bit definition for TIM_PSC register *********************************************/
#define TIM_PSC_PSC_Pos                          (0U)
#define TIM_PSC_PSC_Msk                          (0xFFFFUL<<TIM_PSC_PSC_Pos)                      /*!< 0x0000FFFF */
#define TIM_PSC_PSC                              TIM_PSC_PSC_Msk

